IDEA StatiCa Open Model
HangingAroundPatch Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Representing of hanging hanging around patch load/support in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Reinforcement
 IdeaRS.OpenModel.Detail.HangingAroundPatch
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class HangingAroundPatch : Reinforcement
Public Class HangingAroundPatch
	Inherits Reinforcement
public ref class HangingAroundPatch : public Reinforcement
The HangingAroundPatch type exposes the following members.
Constructors
Name | Description
HangingAroundPatch
 Constructor
Top
Properties
Name | Description
BottomPartLength
 Length of bottom part
Diameter
 Diameter o reinforcement
DiameterOfMandrel
 Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
DistanceFromPatch
 Distance from patch support/load
EndsType
 End type of the reinforcement bar - same for both ends
Id
 Element Id
 (Inherited from OpenElementId.)
InclinedPartsAngle
 Inclination of inclined parts
InclinedPartsLength
 Length of inclined parts
IsMirrored
 Add same reinforcement on oposide side (rotated 180°)
LegsLength
 Length of legs
MasterComponent
 Master component of hanging
Material
 Material
 (Inherited from Reinforcement.)
NumOfBarsInLayer
 Number of bars in layer
ReinfId
 Id representing reinforcement in Detail
 (Inherited from Reinforcement.)
Rotation
 Angle of reinforcement rotation around patch point
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace